Autodesk.Revit.DB.ITransactionFinalizer.OnRolledBack(Autodesk.Revit.DB.Document,System.String)
This method is called at the end of rolling back a transaction
document:
The document associated with the transaction
strTransactionName:
The transaction's name
Since:
2011

Autodesk.Revit.DB.ITransactionFinalizer.OnCommitted(Autodesk.Revit.DB.Document,System.String)
This method is called at the end of committing a transaction
document:
The document associated with the transaction
strTransactionName:
The transaction's name
Since:
2011

Autodesk.Revit.DB.ITransactionFinalizer
An interface that may be used to perform a custom action at the end of a transaction.
A method of the interface will be called when a transaction is either committed or rolled back.
Since:
2011